# a = (1, 2, 3, 4, 5, 6)    # cоздаём кортэжи
# print(a[0:3])             # выводим срезы , срез с 0 - индекса до 3 не включая его
# print(a[:3])              # выводим срезы , срез от начала строки до 3индекса не включая его
# print(a[1:])              # выводим срезы , срез от 1 индекса до конца строки
# print(a[2::2])            # выводим срезы , срез от 2 индекса до конца строки с шагом 2
# print(a[::2])             # выводим срезы , срез от начала строки до конца с шагом 2 шаг 2 выводитзлементы через один шаг 3 выводит выводит элементы через два



# a = (10, 2.13,"square",89,'c') # создаём кортэж
# b = [1,2,3]                    # создаём списки
# c = list(a)                    # с помощью функции list - делаем из кортежа список
# d = tuple(b)                   # с помощью функции tuple - делаем из списка кортеж
# print(a)                       # выводим переменные
# print(b)                       # выводим переменные
# print(c)                       # выводим переменные
# print(d)                       # выводим переменные


                         # при сложении кортежей образуем один новый кортеж, складывать можно кортежи с цифрами строками,цифры и строки немогут павторяться
# x = (1,2,3,4)          # при умножении кортежей создаётся новый кортеж в котором элементы повторяются, заданное колличество раз
# y = (1,2,3,4, 5,6,7,8)
# b = ('w','r')
# z = x + y + b
# print(z)



# x = (1,2,3,4)
# z = x * 4
# print(z)




# a = (1, 2, 3, 4, 5, 5, 5)  # создаём кортеж
# print(a.count(5),len(a))   # функция a.count считаем колличество заданного элемента в кортеже функция len выводит длину кортежа


# a = (1, 2, 3, 4, 5, 5, 5, 10)       # создаём кортеж
# print('max', max(a), 'min', min(a)) # выводим при помощи max - максимальный элемент кортежа и при помощи min - минимальный элемент кортежа







# import random                                     # импортируем библиотеку
# a = [random.randint(0, 100) for i in range(10)]   # генерируем случайный список с диапазоном от (0 до 100) с колличеством элементов (10 элементов)
# b = tuple(a)                                      # переводим список в кортеж
# print(b)                                          # выводим кортеж
# print(max(a),min(a))                              # выводим max - элемент min - элемент




# string_set = {"niccholas", "michelle"}
# print(string_set)


# months = set(["jan","feb""march"])
# for n in months:
#     print(n)


# num_set = {1,2,3,4,5,6}
# num_set.clear()
# print(num_set)


# a = set(("jan","feb"))
# b = set(("juli","aug"
# all_months = mo


# a = {1,2,3}
# b = {4,3,6}
# print(a-b)


# a = 100 / 0
# try:
#     k = 1 / 0
# except ZeroDivisionError :
# print()



# my_dict = {"a"1,"b: 2,"c":3}
# try:
#     value = my_dict


# # finally:
# #     print({"Оператор finally"})
# a
#
# else:
#     print("Ошибок finally не найдино!")
#
# a = i





